{
    "text": "^T How we met:\n\n^S We met in a History of the Vikings class in January of 2024. \nIt was the start of a new semester and we sat next to each other in class. \nWe chatted here and there, but on February 14th, Austin asked Jess for help with his history notes. \nHe didn’t need notes for class btw. \nWe met up at the coffee shop on campus and studied, followed by a ride home after jump starting his car. \nThat night we connected and were drawn towards the realness of each other. \nFrom that day on, we continued to hang out on campus and grow in our friendship. \nA week later though, Austin brought up watching “Land of Bad” which was a new movie coming out that we both wanted to see. \nThe movie date was incredible and one of our favorite memories together. \nAlso a movie I would recommend. \nBefore hand, on the drive over to see the film, we discussed dating and what we were looking for in a relationship. \nBoth Austin and Jess were looking to date to marry, knowing exactly what they were looking for. \nHowever, they were both still learning about each other and Jess didn’t know if she was ready to have her first boyfriend. \nAs we continued to hang out and go on dates, we both felt a peace that continued to come over us. \nThis was all the confirmation needed to continue hanging out and officially start dating. \nSoon, we found ourselves slowly falling in love, cheesy I know. \nJess fell in love with Austin’s realness, his love for God, his character, and also the BMW :) \nAustin fell in love with Jess’s ability to be kind no matter the situation.\nShe is incredibly smart, hard working, responsible, and curious, which makes her the perfect person for my spontaneousness.\nJess is always doing her best to make sure I'm taken care of (cooking, cleaning, etc) even when I tell her not to, and that I've got it lol.\nFalling in love was the easy part with Jess, the hard part was making sure I could afford the ring.. check!\nFrom meeting her in class, to buying a TON of peach rings, and a few late night drives, and partner devotions together, Jess has definitely reflected God's love and beauty.\n\n^T Our goals:\n\n^S Throughout these months, we have gone through a lot of learning and growth. \nGiving up the “I” for the “we” and discussing what the future would look like. \nWe decided that keeping our anniversary of February 14th would give us a one year dating period that would also be after graduation. \nWe consider it a one year since we connected so quickly after meeting and that we don’t have an official day that we started dating. \nWe got engaged after six months and will be married on our one year anniversary. \nWe believe that God is blessing this relationship and we are fully committed to a life with each other. \nAfter graduation and marriage, we will move wherever our jobs take us. \nHowever, our end goal is western Montana or wherever we are blessed with a property. \n^F We can’t wait to celebrate with you at our wedding ceremony and reception in February!"
}